spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2014.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
<application xmlns="http://sv.bpc.in/SVAP">
    <application_type>APTPACQA</application_type>                                         <!-- Application type - Acquiring -->
    <application_flow_id>2014</application_flow_id>                                       <!-- Application flow (business process) - Change merchant data -->
    <application_status>APST0006</application_status>                                     <!-- Application status - Ready to process -->
    <operator_id>ADMIN</operator_id>                                                	  <!-- User name who made this application -->
    <institution_id>1001</institution_id>                                                 <!-- Institution identifier -->
    <agent_id>10000001</agent_id>                                                         <!-- Agent identifier -->
    <customer>
        <command>CMMDEXPR</command>                                                       <!-- Command for customer - find existing customer -->
        <customer_number>0000000000000000000697</customer_number>                         <!-- Unique customer number -->
        <contract>
            <command>CMMDEXPR</command>                                                   <!-- Command for contract - find existing contract -->
            <contract_number>00000000000000000000000000000736</contract_number>           <!-- Contract number -->
            <merchant id="merchant_1">
                <command>CMMDEXUP</command>
				<merchant_number>000000070000063</merchant_number>
                <merchant_name>FOOD_N_DRINKS</merchant_name>                              <!-- Merchant system name -->
                <merchant_label language="LANGENG">Food n Drinks Central</merchant_label> <!-- Merchant official name -->
                <mcc>0001</mcc>                                                           <!-- Merchant Category Code -->
                <risk_indicator>FMRI0001</risk_indicator>                                 <!-- Merchant Risk Indicator -->
                <contact id="contact_1">                                                  <!-- Contact -->
                    <command>CMMDEXUP</command>                                           <!-- Command for contact - Create new or update if exists -->
                    <contact_type>CNTTPRMC</contact_type>                                 <!-- Contact type - Primary -->
                    <preferred_lang>LANGENG</preferred_lang>                              <!-- Preferred language of speaking -->
                    <contact_data id="contact_data_1">
                        <commun_method>CMNM0001</commun_method>                           <!-- Communication method - Mobile phone -->
                        <commun_address>79161234567</commun_address>                      <!-- Communication address - Mobile phone number -->
                    </contact_data>
                </contact>
                <address id="address_1">                                                  <!-- Address -->
                    <command>CMMDEXUP</command>                                           <!-- Command for address - Create new or update if exists -->
                    <address_type>ADTPBSNA</address_type>                                 <!-- Address type - Home address -->
                    <country>643</country>                                                <!-- Country ISO code - Russia -->
                    <address_name id="address_name_1" language="LANGENG">                 <!-- Address. Attribute LANGUAGE contain code of language of provided address - English -->
                        <region>Moscow</region>                                           <!-- Region name -->
                        <city>Moscow</city>                                               <!-- Name of city -->
                        <street>Street 1</street>                                         <!-- Street -->
                    </address_name>
                    <house>7</house>                                                      <!-- House number -->
                    <apartment>1</apartment>                                              <!-- Office number -->
                </address>
            </merchant>
        </contract>
    </customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
